---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.JoinGeometry
enum: Autodesk.Revit.UI.PostableCommand
zh: 连接、合并
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.JoinGeometry

**中文**: 连接、合并

Creates clean joins between 2 or more host elements that share a common face, such as walls and floors.